Merge branch 'main' of https://github.com/ericsche/ProxyAgent-C-
